--- a/training-slides/src/async-await-intro.md
+++ b/training-slides/src/async-await-intro.md
@@ -3,10 +3,12 @@
 
 ## Concurrency
 
-```mermaid
-graph TD
-  A[Concurrency] --> B[Asynchrony]
-  A --> C[Parallelism]
+```dot process
+digraph {
+  node [shape=record, fontcolor=black, fontsize=14, width=3, fillcolor=green3, style=filled];
+  Concurrency -> Asynchrony;
+  Concurrency -> Parallelism;
+}
 ```
 
 ## Parallelism
